In [61]:
import pandas as pd
import matplotlib.pyplot as plt
from alpha_vantage.timeseries import TimeSeries
import matplotlib.dates as matDates

In [47]:
confirmed_case = pd.read_csv('time_series_covid19_confirmed_global.csv')
confirmed_death = pd.read_csv('time_series_covid19_deaths_global.csv')

In [48]:
confirmed_case

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/22/22,11/23/22,11/24/22,11/25/22,11/26/22,11/27/22,11/28/22,11/29/22,11/30/22,12/1/22
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,205324,205391,205506,205541,205612,205612,205802,205830,205907,206073
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,333282,333293,333305,333316,333322,333330,333330,333338,333343,333360
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271035,271041,271050,271057,271061,271061,271079,271082,271090,271096
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,46824,46824,46824,46824,46824,46824,46824,46824,47219,47219
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,103131,104491,104491,104491,104491,104491,104491,104491,104676,104676
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703036,703036,703036,703036,703036,703036,703036,703036,703036,703036
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,333721,333721,333721,333721,333721,333721,333721,333746,333746,333746
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,257893,257893,257893,257893,257893,257893,257893,257893,259164,259164

In [49]:
confirmed_death

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/22/22,11/23/22,11/24/22,11/25/22,11/26/22,11/27/22,11/28/22,11/29/22,11/30/22,12/1/22
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,7833,7833,7833,7833,7833,7833,7833,7833,7833,7834
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,3594,3594,3594,3594,3594,3594,3594,3594,3594,3594
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,6881,6881,6881,6881,6881,6881,6881,6881,6881,6881
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,156,156,156,156,156,156,156,156,157,157
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,1917,1923,1923,1923,1923,1923,1923,1923,1924,1924
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,5708,5708,5708,5708,5708,5708,5708,5708,5708,5708
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2159,2159,2159,2159,2159,2159,2159,2159,2159,2159
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,4019,4019,4019,4019,4019,4019,4019,4019,4019,4019
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,5606,5606,5606,5606,5606,5606,5606,5606,5620,5620

In [50]:
confirmed_case['Total_cases'] = confirmed_case.iloc[:,4:].sum(axis=1)

In [51]:
confirmed_case

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/23/22,11/24/22,11/25/22,11/26/22,11/27/22,11/28/22,11/29/22,11/30/22,12/1/22,Total_cases
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,205391,205506,205541,205612,205612,205802,205830,205907,206073,109596433
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,333293,333305,333316,333322,333330,333330,333338,333343,333360,152829928
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271041,271050,271057,271061,271061,271079,271082,271090,271096,156153493
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,46824,46824,46824,46824,46824,46824,46824,47219,47219,19868545
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,104491,104491,104491,104491,104491,104491,104491,104676,104676,49726513
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703036,703036,703036,703036,703036,703036,703036,703036,703036,343629272
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,162032
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,6708825
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,333721,333721,333721,333721,333721,333721,333746,333746,333746,162802502
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,257893,257893,257893,257893,257893,257893,257893,259164,259164,114777232

In [53]:
confirmed_death['Total_Death_Cases'] = confirmed_death.iloc[:,4:].sum(axis=1)
confirmed_death

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/23/22,11/24/22,11/25/22,11/26/22,11/27/22,11/28/22,11/29/22,11/30/22,12/1/22,Total_Death_Cases
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,7833,7833,7833,7833,7833,7833,7833,7833,7834,4650362
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,3594,3594,3594,3594,3594,3594,3594,3594,3594,2132993
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,6881,6881,6881,6881,6881,6881,6881,6881,6881,4226937
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,156,156,156,156,156,156,156,157,157,111151
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,1923,1923,1923,1923,1923,1923,1923,1924,1924,1042716
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,5708,5708,5708,5708,5708,5708,5708,5708,5708,3195325
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2159,2159,2159,2159,2159,2159,2159,2159,2159,1303864
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,4019,4019,4019,4019,4019,4019,4019,4019,4019,2236085
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,5606,5606,5606,5606,5606,5606,5606,5620,5620,2907506

In [57]:
new_confirmed_case = confirmed_case[['Province/State', 'Country/Region', 'Total_cases']]
new_confirmed_case

    Province/State        Country/Region  Total_cases
0              NaN           Afghanistan    109596433
1              NaN               Albania    152829928
2              NaN               Algeria    156153493
3              NaN               Andorra     19868545
4              NaN                Angola     49726513
..             ...                   ...          ...
284            NaN    West Bank and Gaza    343629272
285            NaN  Winter Olympics 2022       162032
286            NaN                 Yemen      6708825
287            NaN                Zambia    162802502
288            NaN              Zimbabwe    114777232

[289 rows x 3 columns]

In [59]:
new_confirmed_death = confirmed_death[['Province/State', 'Country/Region', 'Total_Death_Cases']]
new_confirmed_death

    Province/State        Country/Region  Total_Death_Cases
0              NaN           Afghanistan            4650362
1              NaN               Albania            2132993
2              NaN               Algeria            4226937
3              NaN               Andorra             111151
4              NaN                Angola            1042716
..             ...                   ...                ...
284            NaN    West Bank and Gaza            3195325
285            NaN  Winter Olympics 2022                  0
286            NaN                 Yemen            1303864
287            NaN                Zambia            2236085
288            NaN              Zimbabwe            2907506

[289 rows x 3 columns]

In [60]:
global_data = pd.merge(new_confirmed_case, new_confirmed_death, on=['Province/State', 'Country/Region'])
global_data

    Province/State        Country/Region  Total_cases  Total_Death_Cases
0              NaN           Afghanistan    109596433            4650362
1              NaN               Albania    152829928            2132993
2              NaN               Algeria    156153493            4226937
3              NaN               Andorra     19868545             111151
4              NaN                Angola     49726513            1042716
..             ...                   ...          ...                ...
284            NaN    West Bank and Gaza    343629272            3195325
285            NaN  Winter Olympics 2022       162032                  0
286            NaN                 Yemen      6708825            1303864
287            NaN                Zambia    162802502            2236085
288            NaN              Zimbabwe    114777232            2907506

[289 rows x 4 columns]

## Alpha-Vantage

In [118]:
api_key = '87FT3I3RK5F9TKMJ'
ts = TimeSeries(key=api_key, output_format='pandas')
canadian = ts.get_daily_adjusted('TSCO.LON', outputsize='full')
american = ts.get_daily_adjusted('NASDX', outputsize='full')
travel = ts.get_daily_adjusted('AC', outputsize='full')
real_estate = ts.get_daily_adjusted('PLD', outputsize='full')
precious_metals = ts.get_daily_adjusted('CIGI', outputsize='full')

In [119]:
canadian_df = pd.DataFrame(canadian[0]).reset_index(level=0)
american_df = pd.DataFrame(american[0]).reset_index(level=0)
travel_df = pd.DataFrame(travel[0]).reset_index(level=0)
real_estate_df = pd.DataFrame(real_estate[0]).reset_index(level=0)
precious_metals_df = pd.DataFrame(precious_metals[0]).reset_index(level=0)

In [120]:
canadian_df.drop('8. split coefficient', inplace=True, axis=1)

In [121]:
canadian_df

,date,1. open,2. high,3. low,4. close,5. adjusted close,6. volume,7. dividend amount
0,2022-12-02,228.2000,230.5510,226.8780,228.5000,228.5000,13417739.0,0.0
1,2022-12-01,229.3000,231.6000,228.3000,228.7000,228.7000,15118000.0,0.0
2,2022-11-30,234.2000,234.9000,227.0000,227.5000,227.5000,39639781.0,0.0
3,2022-11-29,232.4000,235.2640,232.1000,233.0000,233.0000,13560580.0,0.0
4,2022-11-28,234.6000,235.3000,232.4000,232.6000,232.6000,18823801.0,0.0
...,...,...,...,...,...,...,...,...
4524,2005-01-10,319.7501,320.5001,319.0001,320.2501,186.5283,11117302.0,0.0
4525,2005-01-07,317.7501,321.2501,317.7501,319.7501,186.2370,37111214.0,0.0
4526,2005-01-06,315.0001,320.0001,314.7501,318.7501,185.6546,17598422.0,0.0
4527,2005-01-05,315.5001,318.0001,315.0001,315.0001,183.4704,28205028.0,0.0
4528,2005-01-04,319.2501,321.2501,317.0001,318.0001,185.2178,35678243.0,0.0

In [122]:
american_df.drop('8. split coefficient', inplace=True, axis=1)

In [123]:
travel_df.drop('8. split coefficient', inplace=True, axis=1)

In [124]:
real_estate_df.drop('8. split coefficient', inplace=True, axis=1)

In [125]:
precious_metals_df.drop('8. split coefficient', inplace=True, axis=1)

In [126]:
american_df = american_df[['date', '2. high', '3. low']].rename(columns={'2. high': 'american_high', '3. low': 'american_low'})
canadian_df = canadian_df[['date', '2. high', '3. low']].rename(columns={'2. high': 'canadian_high', '3. low': 'canadian_low'})
travel_df = travel_df[['date', '2. high', '3. low']].rename(columns={'2. high': 'travel_high', '3. low': 'travel_low'})
real_estate_df = real_estate_df[['date', '2. high', '3. low']].rename(columns={'2. high': 'real_estate_high', '3. low': 'real_estate_low'})
precious_metals_df = precious_metals_df[['date', '2. high', '3. low']].rename(columns={'2. high': 'precious_metals_high', '3. low': 'precious_metals_low'})

In [136]:
stocks_df = canadian_df.merge(american_df, on='date').merge(travel_df, on='date').merge(real_estate_df, on='date').merge(precious_metals_df, on='date')

stocks_df

,date,canadian_high,canadian_low,american_high,american_low,travel_high,travel_low,real_estate_high,real_estate_low,precious_metals_high,precious_metals_low
0,2022-12-01,231.600,228.30,26.01,26.01,40.4500,38.13,119.49,115.74,96.95,92.37
1,2022-11-30,234.900,227.00,25.97,25.97,40.4500,38.00,117.82,112.49,94.68,91.22
2,2022-11-29,235.264,232.10,25.57,25.57,40.9800,38.60,114.12,111.26,92.65,91.16
3,2022-11-28,235.300,232.40,25.75,25.75,42.0000,40.37,116.85,110.92,94.17,91.49
4,2022-11-25,238.800,235.00,26.13,26.13,40.6000,40.60,116.94,115.26,94.98,93.37
...,...,...,...,...,...,...,...,...,...,...,...
1726,2015-12-07,162.800,156.65,12.02,12.02,34.7500,33.74,42.83,42.37,44.30,43.70
1727,2015-12-04,164.600,161.05,12.08,12.08,34.4900,33.90,42.72,41.63,44.43,43.73
1728,2015-12-03,170.800,163.90,11.80,11.80,36.5100,33.87,42.73,41.29,44.87,43.57
1729,2015-12-02,169.000,166.55,12.01,12.01,35.5300,33.33,43.49,42.19,45.74,44.24
1730,2015-12-01,169.100,166.10,12.09,12.09,34.0599,29.50,43.69,42.91,45.51,45.05